{
    "Warren Buffet": {
        "Someone’s sitting in the shade today because someone planted a tree a long time ago.": "Warren Buffett",
        "If you aren’t willing to own a stock for 10 years, don’t even think about owning it for 10 minutes.": "Warren Buffett",
        "The most important investment you can make is in yourself.": "Warren Buffett",
        "I will tell you how to become rich. Close the doors. Be fearful when others are greedy. Be greedy when others are fearful.": "Warren Buffett",
        "Never depend on a single income. Make an investment to create a second source.": "Warren Buffett",
        "No matter how great the talent or efforts, some things just take time. You can’t produce a baby in one month by getting nine women pregnant.": "Warren Buffett",
        "Don’t pass up something that’s attractive today because you think you will find something better tomorrow.": "Warren Buffett",
        "You only have to do a few things right in your life so long as you don’t do too many things wrong.": "Warren Buffett"
    },

    "Albert Einstein": {
        "Imagination is everything. It is the preview of life’s coming attractions.": "Albert Einstein",
        "Creativity is seeing what others see and thinking what no one else ever thought.": "Albert Einstein",
        "The true sign of intelligence is not knowledge, but imagination.": "Albert Einstein",
        "We cannot solve our problems with the same thinking we used when we created them.": "Albert Einstein",
        "I have no special talent. I am only passionately curious.": "Albert Einstein",
        "The only reason for time is so that everything doesn’t happen at once.": "Albert Einstein",
        "Only a life lived for others is a life worthwhile.": "Albert Einstein",
        "It should be possible to explain the laws of physics to a barmaid.": "Albert Einstein",
        "Let us not forget that human knowledge and skills alone cannot lead humanity to a happy and dignified life.": "Albert Einstein",
        "Pure mathematics is, in its way, the poetry of logical ideas.": "Albert Einstein",
        "As far as the laws of mathematics refer to reality, they are not certain, and as far as they are certain, they do not refer to reality.": "Albert Einstein"
    },

    "Marcus Aurelius": {
        "You have power over your mind - not outside events. Realize this, and you will find strength.": "Marcus Aurelius, Meditations",
        "Dwell on the beauty of life. Watch the stars, and see yourself running with them.": "Marcus Aurelius, Meditations",
        "The happiness of your life depends upon the quality of your thoughts.": "Marcus Aurelius, Meditations",
        "Everything we hear is an opinion, not a fact. Everything we see is a perspective, not the truth.": "Marcus Aurelius, Meditations",
        "Waste no more time arguing about what a good man should be. Be one.": "Marcus Aurelius, Meditations",
        "If you are distressed by anything external, the pain is not due to the thing itself, but to your estimate of it; and this you have the power to revoke at any moment.": "Marcus Aurelius, Meditations",
        "When you arise in the morning think of what a privilege it is to be alive, to think, to enjoy, to love ...": "Marcus Aurelius, Meditations",
        "The best revenge is to be unlike him who performed the injury.": "Marcus Aurelius, Meditations",
        "Accept the things to which fate binds you, and love the people with whom fate brings you together,but do so with all your heart.": "Marcus Aurelius, Meditations",
        "The soul becomes dyed with the colour of its thoughts.": "Marcus Aurelius, Meditations",
        "It is not death that a man should fear, but he should fear never beginning to live.": "Marcus Aurelius, Meditations",
        "Never let the future disturb you. You will meet it, if you have to, with the same weapons of reason which today arm you against the present.": "Marcus Aurelius, Meditations",
        "How much more grievous are the consequences of anger than the causes of it.": "Marcus Aurelius, Meditations"
    },

    "Alexander the Great": {
        "There is nothing impossible to him who will try.": "Alexander the Great",
        "I am indebted to my father for living, but to my teacher for living well.": "Alexander the Great",
        "A tomb now suffices him for whom the world was not enough.": "Alexander the Great",
        "I am not afraid of an army of lions led by a sheep; I am afraid of an army of sheep led by a lion.": "Alexander the Great",
        "When we give someone our time, we actually give a portion of our life that we will never take back.": "Alexander the Great",
        "Through every generation of the human race there has been a constant war, a war with fear. Those who have the courage to conquer it are made free and those who are conquered by it are made to suffer until they have the courage to defeat it, or death takes them.": "Alexander the Great",
        "Now that the wars are coming to an end, I wish you to prosper in peace. May all mortals from now on live like one people in concord and for mutual advancement. Consider the world as your country, with laws common to all and where the best will govern irrespective of tribe. I do not distinguish among men, as the narrow-minded do, both among Greeks and Barbarians. I am not interested in the descendance of the citizens or their racial origins. I classify them using one criterion: their virtue. For me every virtuous foreigner is a Greek and every evil Greek worse than a Barbarian. If differences ever develop between you never have recourse to arms, but solve them peacefully. If necessary, I should be your arbitrator.": "Alexander the Great",
        "Sex and sleep alone make me conscious that I am mortal.": "Alexander the Great",
        "Upon the conduct of each depends the fate of all.": "Alexander the Great",
        "There are no more worlds to conquer!": "Alexander the Great",
        "My treasure lies in my friends.": "Alexander the Great",
        "Now you fear punishment and beg for your lives, so I will let you free, if not for any other reason so that you can see the difference between a Greek king and a barbarian tyrant, so do not expect to suffer any harm from me. A king does not kill messengers.": "Alexander the Great",
        "Each moment free from fear makes a man immortal.": "Alexander the Great",
        "Glory crowns the deeds of those who expose themselves to toils and dangers.": "Alexander the Great",
        "There are so many worlds, and I have not yet conquered even one": "Alexander the Great",
        "When you bury my body, don’t build any momentum and keep my hands outside so that the world knows that the person who won the whole world had nothing in his hand while dying.": "Alexander the Great",
        "For my part, I think that to a man of spirit there is no other aim and end of his labours except the labours themselves.": "Alexander the Great",
        "When my casket is being carried to the grave, leave my hands hanging outside. For empty-handed, I came into this world and empty-handed, I shall go! My whole life has been a hallow waste, a futile exercise, for no one at death can take anything with them!": "Alexander the Great"
    },

    "Steve Jobs": {
        "Creativity is just connecting things. When you ask creative people how they did something, they feel a little guilty because they didn’t really do it, they just saw something. It seemed obvious to them after a while.": "Steve Jobs",
        "If you really look closely, most overnight successes took a long time.": "Steve Jobs",
        "Innovation distinguishes between a leader and a follower.": "Steve Jobs",
        "Your time is limited, so don’t waste it living someone else’s life.": "Steve Jobs",
        "Don’t let the noise of others’ opinions drown out your own inner voice.": "Steve Jobs",
        "You can’t connect the dots looking forward; you can only connect them looking backwards. So you have to trust that the dots will somehow connect in your future.": "Steve Jobs",
        "Be a yardstick of quality. Some people aren’t used to an environment where excellence is expected.": "Steve Jobs",
        "Stay hungry. Stay foolish.": "Steve Jobs",
        "I’m convinced that about half of what separates the successful entrepreneurs from the nonsuccessful ones is pure perseverance.": "Steve Jobs",
        "You can’t just ask customers what they want and then try to give that to them. By the time you get it built, they’ll want something new.": "Steve Jobs",
        "People think focus means saying yes to the thing you’ve got to focus on. It means saying no to the hundred other good ideas that there are. You have to pick carefully.": "Steve Jobs",
        "We’re here to put a dent in the universe. Otherwise why else even be here?": "Steve Jobs"
    },

    "Business": {
        "Success is not final; failure is not fatal: it is the courage to continue that counts.": "Winston Churchill",
        "Play by the rules, but be ferocious.": "Phil Knight",
        "Business opportunities are like buses, there’s always another one coming.": "Richard Branson",
        "Every problem is a gift—without problems we would not grow.": "Anthony Robbins",
        "Success usually comes to those who are too busy to be looking for it.": "Henry David Thoreau",
        "There’s no shortage of remarkable ideas, what’s missing is the will to execute them.": "Seth Godin",
        "I owe my success to having listened respectfully to the very best advice, and then going away and doing the exact opposite.": "G.K. Chesterton",
        "I don’t know the word ’quit.’ Either I never did, or I have abolished it.": "Susan Butcher",
        "Far and away the best prize that life offers is the chance to work hard at work worth doing.": "Theodore Roosevelt",
        "Almost everything worthwhile carries with it some sort of risk, whether it’s starting a new business, whether it’s leaving home, whether it’s getting married, or whether it’s flying into space.": "Chris Hadfield",
        "Even if you are on the right track, you’ll get run over if you just sit there.": "Will Rodgers",
        "The real test is not whether you avoid this failure, because you won’t. It’s whether you let it harden or shame you into inaction, or whether you learn from it; whether you choose to persevere.": "Barack Obama",
        "Forget past mistakes. Forget failures. Forget everything except what you’re going to do now and do it.": "William Durant",
        "Character cannot be developed in ease and quiet. Only through experience of trial and suffering can the soul be strengthened, ambition inspired and success achieved.": "Helen Keller",
        "The first one gets the oyster, the second gets the shell.": "Andrew Carnegie",
        "The way to get started is to quit talking and begin doing.": "Walt Disney",
        "Whether you think you can or whether you think you can’t, you’re right!": "Henry Ford",
        "There are no secrets to success. It is the result of preparation, hard work and learning from failure.": "Colin Powell",
        "Success is not the key to happiness. Happiness is the key to success. If you love what you are doing, you will be successful.": "Albert Schweitzer",
        "Success is often achieved by those who don’t know that failure is inevitable.": "Coco Chanel",
        "Many of life’s failures are people who did not realize how close they were to success when they gave up.": "Thomas Edison",
        "I feel that luck is preparation meeting opportunity.": "Oprah Winfrey",
        "I never dreamed about success. I worked for it.": "Estée Lauder",
        "The only place where success comes before work is in the dictionary.": "Vidal Sassoon",
        "The only way around is through.": "Robert Frost"
    },

    "Creativity": {
        "Art is the elimination of the unnecessary.": "Pablo Picasso",
        "You use a glass mirror to see your face. You use works of art to see your soul.": "George Bernard Shaw",
        "A creative life is an amplified life. It’s a bigger life, a happier life, an expanded life, and a hell of a lot more interesting life": "Elizabeth Gilbert",
        "Don’t wait for inspiration. It comes while working.": "Henri Matisse",
        "The worst enemy to creativity is self-doubt.": "Sylvia Plath",
        "Creativity is inventing, experimenting, growing, taking risks, breaking rules, making mistakes, and having fun.": "Mary Lou Cook",
        "It’s no good being too easily swayed by people’s opinions. You have to believe in yourself.": "Donatella Versace",
        "There is no doubt that creativity is the most important human resource of all. Without creativity, there would be no progress, and we would be forever repeating the same patterns.": "Edward De Bono",
        "Begin by learning to draw and paint like the old masters. After that, you can do as you like; everyone will respect you.": "Salvador Dali",
        "You can’t use up creativity. The more you use, the more you have.": "Maya Angelou",
        "There is no innovation and creativity without failure.": "Brené Brown",
        "The creative process is a process of surrender, not control.": "Bruce Lee",
        "The creative adult is the child who survived.": "Ursula Le Guin",
        "Great things are done by a series of small things brought together.": "Vincent Van Gogh",
        "Make visible what, without you, might perhaps never have been seen.": "Oprah Winfrey",
        "Simplicity is the ultimate sophistication.": "Leonardo Da Vinci",
        "Draw the art you want to see, start the business you want to run, play the music you want to hear, write the books you want to read, build the products you want to use - do the work you want to see done.": "Austin Kleon",
        "Everything you can imagine is real.": "Pablo Picasso",
        "Imagination is the beginning of creation. You imagine what you desire, you will what you imagine, and at last, you create what you will.": "George Bernard Shaw",
        "Creativity is… seeing something that doesn’t exist already. You need to find out how you can bring it into being and that way be a playmate with God.": "Michele Shea",
        "Everyone who’s ever taken a shower has had an idea. It’s the person who gets out of the shower, dries off, and does something about it who makes a difference.": "Nolan Bushnell",
        "Creativity can solve almost any problem. The creative act, the defeat of habit by originality, overcomes everything.": "George Lois",
        "Invention, it must be humbly admitted, does not consist in creating out of void but out of chaos.": "Mary Shelley",
        "True alchemy lies in this formula: ’Your memory and your senses are but the nourishment of your creative impulse.’": "Arthur Rimbaud",
        "Odd how the creative power at once brings the whole universe to order.": "Virginia Woolf"
    },

    "Programming": {
        "Any fool can write code that a computer can understand. Good programmers write code that humans can understand.": "Martin Fowler",
        "First, solve the problem. Then, write the code.": "John Johnson",
        "Experience is the name everyone gives to their mistakes.": "Oscar Wilde",
        "In order to be irreplaceable, one must always be different.": "Coco Chanel",
        "Java is to JavaScript what car is to Carpet.": "Chris Heilmann",
        "Knowledge is power.": "Francis Bacon",
        "Sometimes it pays to stay in bed on Monday, rather than spending the rest of the week debugging Monday’s code.": "Dan Salomon",
        "Perfection is achieved not when there is nothing more to add, but rather when there is nothing more to take away.": "Antoine de Saint-Exupery",
        "Ruby is rubbish! PHP is phpantastic!": "Nikita Popov",
        "Code is like humor. When you have to explain it, it’s bad.": "Cory House",
        "Fix the cause, not the symptom.": "Steve Maguire",
        "Optimism is an occupational hazard of programming: feedback is the treatment.": "Kent Beck",
        "When to use iterative development? You should use iterative development only on projects that you want to succeed.": "Martin Fowler",
        "Simplicity is the soul of efficiency.": "Austin Freeman",
        "Before software can be reusable it first has to be usable.": "Ralph Johnson",
        "Make it work, make it right, make it fast.": "Kent Beck"
    },

    "Artificial Intelligence": {
        "The development of full artificial intelligence could spell the end of the human race….It would take off on its own, and re-design itself at an ever increasing rate. Humans, who are limited by slow biological evolution, couldn’t compete, and would be superseded.": "Stephen Hawking told the BBC",
        "I visualise a time when we will be to robots what dogs are to humans, and I’m rooting for the machines.": "Claude Shannon",
        "Artificial intelligence would be the ultimate version of Google. The ultimate search engine that would understand everything on the web. It would understand exactly what you wanted, and it would give you the right thing. We’re nowhere near doing that now. However, we can get incrementally closer to that, and that is basically what we work on.": "Larry Page",
        "The pace of progress in artificial intelligence (I’m not referring to narrow AI) is incredibly fast. Unless you have direct exposure to groups like Deepmind, you have no idea how fast—it is growing at a pace close to exponential. The risk of something seriously dangerous happening is in the five-year time frame. 10 years at most.": "Elon Musk",
        "I don’t want to really scare you, but it was alarming how many people I talked to who are highly placed people in AI who have retreats that are sort of ‘bug out’ houses, to which they could flee if it all hits the fan.": "James Barrat, author of Our Final Invention: Artificial Intelligence and the End of the Human Era",
        "The key to artificial intelligence has always been the representation.": "Jeff Hawkins",
        "I’m more frightened than interested by artificial intelligence - in fact, perhaps fright and interest are not far away from one another. Things can become real in your mind, you can be tricked, and you believe things you wouldn’t ordinarily. A world run by automatons doesn’t seem completely unrealistic anymore. It’s a bit chilling.": "Gemma Whelan",
        "Artificial intelligence will reach human levels by around 2029. Follow that out further to, say, 2045, and we will have multiplied the intelligence - the human biological machine intelligence of our civilization - a billion-fold.": "Ray Kurzweil, American inventor and futurist",
        "We have seen AI providing conversation and comfort to the lonely; we have also seen AI engaging in racial discrimination. Yet the biggest harm that AI is likely to do to individuals in the short term is job displacement, as the amount of work we can automate with AI is vastly larger than before. As leaders, it is incumbent on all of us to make sure we are building a world in which every individual has an opportunity to thrive.": "Andrew Ng, Co-founder and lead of Google Brain",
        "It seems probable that once the machine thinking method had started, it would not take long to outstrip our feeble powers… They would be able to converse with each other to sharpen their wits. At some stage, therefore, we should have to expect the machines to take control.": "Alan Turing",
        "Robots are not going to replace humans, they are going to make their jobs much more humane. Difficult, demeaning, demanding, dangerous, dull - these are the jobs robots will be taking.": "Sabine Hauert",
        "Success in creating AI would be the biggest event in human history. Unfortunately, it might also be the last, unless we learn how to avoid the risks.": "Stephen Hawking",
        "If people trust artificial intelligence (AI) to drive a car, people will most likely trust AI to do your job.": "Dave Waters",
        "New technologies are rapidly giving rise to unprecedented methods of warfare. Innovations that yesterday were science fiction could cause catastrophe tomorrow, including nanotechnologies, combat robots, and laser weapons.": "Peter Maurer",
        "The Zeroth Law: A robot may not harm humanity, or, by inaction, allow humanity to come to harm.": "Isaac Asimov, I, Robot",
        "1: A robot may not injure a human being or, through inaction, allow a human being to come to harm": "Isaac Asimov, I, Robot",
        "2: A robot must obey the orders given it by human beings except where such orders would conflict with the First Law": "Isaac Asimov, I, Robot",
        "3: A robot must protect its own existence as long as such protection does not conflict with the First or Second Law": "Isaac Asimov, I, Robot"
    },

    "Hacking": {
        "Amateurs hack systems, professionals hack people.": "Bruce Schneier",
        "If you spend more on coffee than on IT security, you will be hacked. What’s more, you deserve to be hacked.": "Richard Clarke",
        "Time is what determines security. With enough time nothing is unhackable.": "Aniekee Tochukwu Ezekiel",
        "Yes, I am a criminal. My crime is that of curiosity. My crime is that of outsmarting you, something that you will never forgive me for. I am a hacker, and this is my manifesto. You may stop this individual, but you can’t stop us all… after all, we’re all alike.": "The Mentor (Loyd Blankenship)",
        "No technology that’s connected to the Internet is unhackable.": "Abhijit Naskar",
        "As a matter of fact, yeah, they were foolproof. The problem is that you don’t have to protect yourself against fools. You have to protect yourself against people like me.": "Jeffery Deaver",
        "Never underestimate the determination of a kid who is time-rich and cash-poor.": "Cory Doctorow",
        "It is a fairly open secret that almost all system can be hacked, somehow. It is a less spoken of secret that such hacking has actually gone quite mainstream.": "Dan Kaminsky",
        "Most hackers are young because young people tend to be adaptable. As long as you remain adaptable, you can always be a good hacker.": "Emmanuel Goldstein",
        "I was addicted to hacking, more for the intellectual challenge, the curiosity, the seduction of adventure; not for stealing, or causing damage or writing computer viruses.": "Kevin Mitnick",
        "One single vulnerability all an attacker needs.": "Window Snyder",
        "For every lock, there is someone out there trying to pick it or break in.": "David Bernstein",
        "There are more hackers breeding every day, and more brilliant minds are turning into hackers. Security has advanced, but so have hackers.": "Michael Demon Calce",
        "While many hackers have the knowledge, skills, and tools to attack computer systems, they generally lack the motivation to cause violence or severe economic or social harm.": "Dorothy E. Denning",
        "The hacker mindset doesn’t actually see what happens on the other side, to the victim.": "Kevin Mitnick"
    },

    "Mathematics": {
        "Without mathematics, there’s nothing you can do. Everything around you is mathematics. Everything around you is numbers.": "Shakuntala Devi, Indian writer and mental calculator",
        "Mathematics is the most beautiful and most powerful creation of the human spirit.": "Stefan Banach, Polish mathematician",
        "We will always have STEM with us. Some things will drop out of the public eye and go away, but there will always be science, engineering, and technology. And there will always, always be mathematics.": "Katherine Johnson, African-American mathematician",
        "Mathematics as an expression of the human mind reflects the active will, the contemplative reason, and the desire for aesthetic perfection. Its basic elements are logic and intuition, analysis and construction, generality and individuality.": "Richard Courant, German-American mathematician",
        "What is mathematics? It is only a systematic effort of solving puzzles posed by nature.": "Shakuntala Devi",
        "‘Obvious’ is the most dangerous word in mathematics.": "Eric Temple Bell, Scottish mathematician",
        "It is impossible to be a mathematician without being a poet in soul.": "Sofia Kovalevskaya, Russian mathematician",
        "A mathematician who is not also something of a poet will never be a complete mathematician.": "Karl Weierstrass, German mathematician",
        "Mathematics is not about numbers, equations, computations, or algorithms: it is about understanding.": "William Paul Thurston, American mathematician",
        "Why do children dread mathematics? Because of the wrong approach. Because it is looked at as a subject.": "Shakuntala Devi",
        "Millions saw the apple fall, but Newton asked why.": "Bernard Baruch, American financier, philanthropist and statesman",
        "If I were again beginning my studies, I would follow the advice of Plato and start with mathematics.": "Galileo Galilei",
        "Pure mathematicians just love to try unsolved problems — they love a challenge.": "Andrew Wiles, English mathematician",
        "Just because we can’t find a solution, it doesn’t mean there isn’t one.": "Andrew Wiles, English mathematician",
        "The only way to learn mathematics is to do mathematics.": "Paul R. Halmos, Hungarian-American mathematician",
        "Mathematics is the language in which God has written the universe.": "Galileo Galilei"
    },

    "Others": {
        "When you have a dream, you’ve got to grab it and never let go.": "Carol Burnett",
        "Be courageous. Challenge orthodoxy. Stand up for what you believe in. When you are in your rocking chair talking to your grandchildren many years from now, be sure you have a good story to tell.": "Amal Clooney",
        "Success is not final, failure is not fatal: it is the courage to continue that counts.": "Winston Churchill",
        "You are never too old to set another goal or to dream a new dream.": "Malala Yousafzai",
        "Where your fear is, there is your task.": "Carl Jung",
        "Everything you ever wanted is on the other side of fear.": "George Adair",
        "You must understand that there is more than one path to the top of the mountain.": "Miyamoto Musashi, A Book of Five Rings",
        "A ship in harbor is safe, but that is not what ships are built for.": "John A. Shedd"
    }
}